In [5]:
import env
import pandas as pd
import numpy as np

In [ ]:
url = env.get_connection('tiny_data')
query = 'select * from attendance'
df = pd.read_sql(query,url)

In [3]:
df = pd.read_csv('query_result.csv')

In [4]:
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [10]:
df = df.rename(columns = {'Unnamed: 0':'student'})

In [12]:
df

,student,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [15]:
df = df.melt(id_vars='student',var_name='date',value_name='status')

In [24]:
df.head()

  student        date status
0   Sally  2018-01-01      P
1    Jane  2018-01-01      A
2   Billy  2018-01-01      A
3    John  2018-01-01      P
4   Sally  2018-01-02      T

In [25]:
df['att_points']=np.where(df.status=='P',1)

ValueError: either both or neither of x and y should be given